const shlokas = require("./utils/dataset");

const shlokaCtrl = async (req, res) => {
  try {
    const query = req.query;

    let ind = parseInt(query.chapter);
    ind = ind - 1;

    // let chapter1 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp धृतराष्ट्र उवाच धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः | <br/> &nbsp&nbsp&nbsp&nbspमामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp धृतराष्ट्र ने कहा – हे संजय ! धर्मभूमि कुरुक्षेत्र में युद्ध की इच्छा से एकत्र हुए मेरे तथा पाण्डु के पुत्रों ने क्या किया ?",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp तस्य सञ्जनयन्हर्षं कुरुवृद्धः पितामहः। <br/> &nbsp&nbsp&nbsp&nbspसिंहनादं विनद्योच्चैः शंख दध्मो प्रतापवान्‌ ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp उस दुर्योधन के हृदय में हर्ष उत्पन्न करते हुए, कौरवों में श्रेष्ठ, प्रतापी पितामह भीष्म ने उच्च स्वर से सिंहनाद करते हुए शंख बजाया",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp सीदन्ति मम गात्राणि मुखं च परिशुष्यति। <br/> &nbsp&nbsp&nbsp&nbspवेपथुश्च शरीरे मे रोमहर्षश्च जायते॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  अर्जुन बोले- हे कृष्ण! यहाँ मैं युद्ध के अभिलाषी स्वजनों को ही देखता हूँ। मेरे अंग शिथिल हुए हो रहे हैं <br/>&nbsp&nbsp&nbsp&nbspऔर मुख सूख रहा है और मेरे शरीर में मेरा शरीर काँप रहा है और रोएं खड़े हो रहे हैं ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अहो बत महत्पापं कर्तुं व्यवसिता वयम्‌। <br/> &nbsp&nbsp&nbsp&nbspयद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp अरे बड़े दुर्भाग्य की बात है कि हम लोग राज्य और सुख के लोभ से स्वजनों को मारने रूपी महान पाप करने को भी उद्यत हैं ",
    // ];

    // let chapter2 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp तमुवाच हृषीकेशः प्रहसन्निव भारत। <br/> &nbsp&nbsp&nbsp&nbsp सेनयोरुभयोर्मध्ये विषीदंतमिदं वचः॥  <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे भरतवंशी धृतराष्ट्र! अंतर्यामी भगवान श्रीकृष्ण दोनों सेनाओं के बीच में शोक करते हुए उस अर्जुन से हँसते हुए से यह बोले",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp कर्मण्येवाधिकारस्ते मा फलेषु कदाचन।<br/> &nbsp&nbsp&nbsp&nbsp मा कर्मफलहेतुर्भुर्मा ते संगोऽस्त्वकर्मणि॥  <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp तुम्हारा अधिकार कर्म करने में ही है, उनके फलों में नहीं। तुम कर्मों के फल का कारण मत बनो और तुम्हारी कर्म न करने में भी आसक्ति न हो",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अविनाशि तु तद्विद्धि येन सर्वमिदं ततम्‌। <br/> &nbsp&nbsp&nbsp&nbsp विनाशमव्ययस्यास्य न कश्चित्कर्तुमर्हति॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp नाशरहित तो तुम उसको जानो, जिससे यह सम्पूर्ण दृश्य जगत्‌ व्याप्त है। इस अविनाशी का विनाश करने में कोई भी समर्थ नहीं है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp न त्वेवाहं जातु नासं न त्वं नेमे जनाधिपाः। <br/> &nbsp&nbsp&nbsp&nbsp न चैव न भविष्यामः सर्वे वयमतः परम्‌॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp न तो ऐसा ही है कि मैं किसी काल में नहीं था, तुम नहीं थे अथवा ये राजा लोग नहीं थे और न ऐसा ही है कि इससे आगे हम सब नहीं रहेंगे",
    // ];

    // let chapter3 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp न कर्मणामनारम्भान् नैष्कर्म्यं पुरुषोऽश्नुते।<br/> &nbsp&nbsp&nbsp&nbsp न च संन्यसनादेव सिद्धिं समधिगच्छति॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp मनुष्य न तो कर्मों का आरंभ किए बिना निष्कर्मता को को प्राप्त होता है और न कर्मों के केवल त्यागमात्र से सिद्धि को ही प्राप्त होता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp नियतं कुरु कर्म त्वं कर्म ज्यायो ह्यकर्मणः।<br/> &nbsp&nbsp&nbsp&nbsp शरीरयात्रापि च ते न प्रसिद्ध्येदकर्मणः॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp तुम शास्त्र-विहित कर्मों को करो क्योंकि कर्म न करने की अपेक्षा कर्म करना ही श्रेष्ठ है तथा कर्म न करने से तो तुम्हारा शरीर-निर्वाह भी सिद्ध नहीं होगा",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp न मे पार्थास्ति कर्तव्यं त्रिषु लोकेषु किंचन।<br/> &nbsp&nbsp&nbsp&nbsp नानवाप्तमवाप्तव्यं वर्त एव च कर्मणि॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे अर्जुन! मेरा इन तीनों लोकों में न तो कुछ कर्तव्य है और न कोई भी प्राप्त करने योग्य वस्तु अप्राप्त है, तो भी मैं कर्म में ही बरतता हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अन्नाद्भवन्ति भूतानि पर्जन्यादन्नसम्भवः।<br/> &nbsp&nbsp&nbsp&nbsp यज्ञाद्भवति पर्जन्यो यज्ञः कर्मसमुद्भवः॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp सम्पूर्ण प्राणी अन्न से उत्पन्न होते हैं, अन्न वर्षा से उत्पन्न होता है, वर्षा यज्ञ से होती है और यज्ञ विहित कर्मों से उत्पन्न होने वाला है ",
    // ];

    // let chapter4 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp श्रीभगवानुवाच बहूनि मे व्यतीतानि जन्मानि तव चार्जुन।<br/> &nbsp&nbsp&nbsp&nbsp तान्यहं वेद सर्वाणि न त्वं वेत्थ परन्तप॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbspश्री भगवान बोले – हे परंतप अर्जुन! मेरे और तुम्हारे बहुत से जन्म हो चुके हैं तुम उन सबको नहीं जानते, पर मैं जानता हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यदा यदा हि धर्मस्य ग्लानिर्भवति भारत।<br/> &nbsp&nbsp&nbsp&nbsp अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे भारत! जब-जब धर्म की हानि और अधर्म की वृद्धि होती है, तब-तब मैं अपने (साकार) रूप को रचता हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp परित्राणाय साधूनां विनाशाय च दुष्कृताम्।<br/> &nbsp&nbsp&nbsp&nbsp धर्मसंस्थापनार्थाय सम्भवामि युगे युगे ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbspसाधु पुरुषों का उद्धार करने के लिए, पाप कर्म करने वालों का विनाश करने के लिए और धर्म की यथार्थ स्थापना करने के लिए मैं युग-युग में प्रकट हुआ करता हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp श्रेयान्द्रव्यमयाद्य ज्ञाज्ज्ञानयज्ञः परन्तप।<br/> &nbsp&nbsp&nbsp&nbsp सर्वं कर्माखिलं पार्थ ज्ञाने परिसमाप्यते॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे परंतप अर्जुन! द्रव्यमय यज्ञ की अपेक्षा ज्ञान यज्ञ श्रेष्ठ है (क्योंकि) सम्पूर्ण कर्म ज्ञान में समाप्त हो जाते हैं",
    // ];

    // let chapter5 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp कायेन मनसा बुद्ध्या केवलैरिन्द्रियैरपि।<br/> &nbsp&nbsp&nbsp&nbsp योगिनः कर्म कुर्वन्ति सङ्गं त्यक्त्वात्मशुद्धये ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp कर्मयोगी आसक्ति को त्याग कर, केवल इन्द्रिय, मन, बुद्धि और शरीर द्वारा भी अन्तःकरण की शुद्धि के लिए कर्म करते हैं",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp न कर्तृत्वं न कर्माणि लोकस्य सृजति प्रभुः।<br/> &nbsp&nbsp&nbsp&nbsp न कर्मफलसंयोगं स्वभावस्तु प्रवर्तते॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp आत्मा मनुष्य के न तो कर्तापन की, न कर्मों की और न कर्मफल के संयोग की रचना करता है, किन्तु इसमें स्वभाव(प्रकृति) ही कारण है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp विद्याविनयसंपन्ने ब्राह्मणे गवि हस्तिनि।<br/> &nbsp&nbsp&nbsp&nbsp शुनि चैव श्वपाके च पण्डिताः समदर्शिनः॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp ऐसे ज्ञानी जन विद्या और विनययुक्त ब्राह्मण में, गाय में, हाथी, कुत्ते और चाण्डाल को समान देखते हैं॥",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यतेन्द्रियमनोबुद्धि र्मुनिर्मोक्षपरायणः।<br/> &nbsp&nbsp&nbsp&nbsp विगतेच्छाभयक्रोधो यः सदा मुक्त एव सः॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp जीते हुए मन, बुद्धि और इन्द्रियों वाला मोक्षपरायण मुनि, जो इच्छा, भय और क्रोध से रहित हो गया है, वह सदा मुक्त ही है॥",
    // ];

    // let chapter6 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यं संन्यासमिति प्राहु र्योगं तं विद्धि पाण्डव।<br/> &nbsp&nbsp&nbsp&nbsp  न ह्यसंन्यस्तसंकल्पो योगी भवति कश्चन॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे अर्जुन! जिसको संन्यास कहते हैं, उसी को तुम योग जानो क्योंकि संकल्पों का त्याग न करने वाला कोई भी पुरुष योगी नहीं होता",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp योगी युञ्जीत सततमा त्मानं रहसि स्थितः।<br/> &nbsp&nbsp&nbsp&nbsp  एकाकी यतचित्तात्मा निराशीरपरिग्रहः॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp मन को वश में रखते हुए, आशा और संग्रह रहित होकर योगी अकेले ही मन को स्वयं (आत्मा) में लगाए॥",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यदा विनियतं चित्तमात्मन्येवावतिष्ठते। <br/> &nbsp&nbsp&nbsp&nbsp निःस्पृहः सर्वकामेभ्यो युक्त इत्युच्यते तदा॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp जब नियंत्रित किया हुआ चित्त आत्मा में ही स्थिर हो जाता है, तब सभी भोगों में इच्छा से रहित पुरुष को योगयुक्त कहा जाता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp सुहृन्मित्रार्युदासीन मध्यस्थद्वेष्यबन्धुषु।<br/> &nbsp&nbsp&nbsp&nbsp  साधुष्वपि च पापेषु समबुद्धिर्विशिष्यते ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp सुहृद्, मित्र, वैरी, उदासीन, मध्यस्थ, द्वेष्य, बन्धु, धर्मात्मा और पापियों में भी समान भाव रखने वाला अत्यन्त श्रेष्ठ है",
    // ];

    // let chapter7 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp मत्तः परतरं नान्य त्किंचिदस्ति धनंजय । <br/> &nbsp&nbsp&nbsp&nbsp मयि सर्वमिदं प्रोतं सूत्रे मणिगणा इव ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे धनंजय! मुझसे भिन्न दूसरा कोई भी परम कारण नहीं है। यह सम्पूर्ण जगत सूत्र में सूत्र के मणियों के सदृश मुझमें गुँथा हुआ है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp रसोऽहमप्सु कौन्तेय प्रभास्मि शशिसूर्ययोः । <br/> &nbsp&nbsp&nbsp&nbsp प्रणवः सर्ववेदेषु शब्दः खे पौरुषं नृषु ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे अर्जुन! मैं जल में रस हूँ, चन्द्रमा और सूर्य में प्रकाश हूँ, सम्पूर्ण वेदों में ओंकार हूँ, आकाश में शब्द और पुरुषों में पुरुषत्व हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp बीजं मां सर्वभूतानां विद्धि पार्थ सनातनम् ।<br/> &nbsp&nbsp&nbsp&nbsp  बुद्धिर्बुद्धिमतामस्मि तेजस्तेजस्विनामहम् ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे अर्जुन! तुम सम्पूर्ण भूतों का सनातन बीज मुझको ही जानो। मैं बुद्धिमानों की बुद्धि और तेजस्वियों का तेज हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp जरामरणमोक्षाय मामाश्रित्य यतन्ति ये ।<br/> &nbsp&nbsp&nbsp&nbsp  ते ब्रह्म तद्विदुः कृत्स्नमध्यात्मं कर्म चाखिलम् ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp जो मेरे शरण होकर जरा और मरण से छूटने के लिए यत्न करते हैं, वे पुरुष उस ब्रह्म को, सम्पूर्ण अध्यात्म को, सम्पूर्ण कर्म को जानते हैं॥",
    // ];

    // let chapter8 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अधियज्ञः कथं कोऽत्र देहेऽस्मिन्मधुसूदन ।<br/> &nbsp&nbsp&nbsp&nbsp  प्रयाणकाले च कथं ज्ञेयोऽसि नियतात्मभिः ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे मधुसूदन! यहाँ अधियज्ञ कौन है? और वह इस शरीर में कैसे है? तथा युक्त चित्त वाले पुरुषों द्वारा अंत समय में आप किस प्रकार जानने में आते हैं",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp मामुपेत्य पुनर्जन्म दुःखालयमशाश्वतम् ।<br/> &nbsp&nbsp&nbsp&nbsp  नाप्नुवन्ति महात्मानः संसिद्धिं परमां गताः ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp परम सिद्धि को प्राप्त महात्माजन मुझको प्राप्त होकर दुःखों के घर एवं क्षणभंगुर पुनर्जन्म को नहीं प्राप्त होते",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अर्जुन उवाच - किं तद्ब्रह्म किमध्यात्मं किं कर्म पुरुषोत्तम ।<br/> &nbsp&nbsp&nbsp&nbsp  अधिभूतं च किं प्रोक्तमधिदैवं किमुच्यते ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp अर्जुन ने कहा- हे पुरुषोत्तम! वह ब्रह्म क्या है? अध्यात्म क्या है? कर्म क्या है? अधिभूत नाम से क्या कहा गया है और अधिदैव किसको कहते हैं",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp भूतग्रामः स एवायं भूत्वा भूत्वा प्रलीयते ।<br/> &nbsp&nbsp&nbsp&nbsp  रात्र्यागमेऽवशः पार्थ प्रभवत्यहरागमे ॥ <br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे पार्थ! वही यह भूतसमुदाय उत्पन्न हो-होकर प्रकृति वश में हुआ रात्रि के प्रवेश काल में लीन होता है और दिन के प्रवेश काल में फिर उत्पन्न होता है",
    // ];

    // let chapter9 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अश्रद्दधानाः पुरुषा धर्मस्यास्य परन्तप ।<br/> &nbsp&nbsp&nbsp&nbsp  अप्राप्य मां निवर्तन्ते मृत्युसंसारवर्त्मनि ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे परंतप! इस उपयुक्त धर्म में श्रद्धारहित पुरुष मुझको न प्राप्त होकर मृत्युरूप संसार चक्र में भ्रमण करते रहते हैं",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp मयाध्यक्षेण प्रकृतिः सूयते सचराचरम् ।<br/> &nbsp&nbsp&nbsp&nbsp  हेतुनानेन कौन्तेय जगद्विपरिवर्तते ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे अर्जुन! मुझ अधिष्ठाता के सकाश से प्रकृति चराचर सहित सर्वजगत को रचती है और इस हेतु से ही यह संसारचक्र घूम रहा है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अहं क्रतुरहं यज्ञः स्वधाहमहमौषधम् ।<br/> &nbsp&nbsp&nbsp&nbsp  मन्त्रोऽहमहमेवाज्यम हमग्निरहं हुतम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp क्रतु मैं हूँ, यज्ञ मैं हूँ, स्वधा मैं हूँ, औषधि मैं हूँ, मंत्र मैं हूँ, घृत मैं हूँ, अग्नि मैं हूँ और हवनरूप क्रिया भी मैं ही हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यत्करोषि यदश्नासि यज्जुहोषि ददासि यत् ।<br/> &nbsp&nbsp&nbsp&nbsp  यत्तपस्यसि कौन्तेय तत्कुरुष्व मदर्पणम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे अर्जुन! तू जो कर्म करता है, जो खाता है, जो हवन करता है, जो दान देता है और जो तप करता है, वह सब मेरे अर्पण कर",
    // ];

    // let chapter10 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp पुरोधसां च मुख्यं मां विद्धि पार्थ बृहस्पतिम् ।<br/> &nbsp&nbsp&nbsp&nbsp  सेनानीनामहं स्कन्दः सरसामस्मि सागरः ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  पुरोहितों में मुखिया बृहस्पति मुझको जान। हे पार्थ! मैं सेनापतियों में स्कंद और जलाशयों में समुद्र हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अश्वत्थः सर्ववृक्षाणां देवर्षीणां च नारदः ।<br/> &nbsp&nbsp&nbsp&nbsp  गन्धर्वाणां चित्ररथः सिद्धानां कपिलो मुनिः ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  मैं सब वृक्षों में पीपल का वृक्ष, देवर्षियों में नारद मुनि, गन्धर्वों में चित्ररथ और सिद्धों में कपिल मुनि हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp पवनः पवतामस्मि रामः शस्त्रभृतामहम् ।<br/> &nbsp&nbsp&nbsp&nbsp  झषाणां मकरश्चास्मि स्रोतसामस्मि जाह्नवी ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  मैं पवित्र करने वालों में वायु और शस्त्रधारियों में श्रीराम हूँ तथा मछलियों में मगर हूँ और नदियों में श्री भागीरथी गंगाजी हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp बृहत्साम तथा साम्नां गायत्री छन्दसामहम् ।<br/> &nbsp&nbsp&nbsp&nbsp  मासानां मार्गशीर्षोऽह मृतूनां कुसुमाकरः ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  तथा गायन करने योग्य श्रुतियों में मैं बृहत्साम और छंदों में गायत्री छंद हूँ तथा महीनों में मार्गशीर्ष और ऋतुओं में वसंत मैं हूँ",
    // ];

    // let chapter11 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp न वेदयज्ञाध्ययनैर्न दानै र्न च क्रियाभिर्न तपोभिरुग्रैः ।<br/> &nbsp&nbsp&nbsp&nbsp  एवंरूपः शक्य अहं नृलोके द्रष्टुं त्वदन्येन कुरुप्रवीर ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  हे अर्जुन! मनुष्य लोक में इस प्रकार विश्व रूप वाला मैं न वेद और यज्ञों के अध्ययन से, न दान से, न क्रियाओं से और न उग्र तपों से ही तेरे अतिरिक्त दूसरे द्वारा देखा जा सकता हूँ।",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp श्रीभगवानुवाच सुदुर्दर्शमिदं रूपं दृष्टवानसि यन्मम ।<br/> &nbsp&nbsp&nbsp&nbsp  देवा अप्यस्य रूपस्य नित्यं दर्शनकाङ्क्षिणः ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  श्री भगवान बोले- मेरा जो चतुर्भज रूप तुमने देखा है, वह सुदुर्दर्श है अर्थात्‌ इसके दर्शन बड़े ही दुर्लभ हैं। देवता भी सदा इस रूप के दर्शन की आकांक्षा करते रहते हैं",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp नाहं वेदैर्न तपसा न दानेन न चेज्यया ।<br/> &nbsp&nbsp&nbsp&nbsp  शक्य एवंविधो द्रष्टुं दृष्टवानसि मां यथा ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  जिस प्रकार तुमने मुझको देखा है- इस प्रकार चतुर्भुज रूप वाला मैं न वेदों से, न तप से, न दान से और न यज्ञ से ही देखा जा सकता हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अर्जुन उवाच- दृष्ट्वेदं मानुषं रूपं तव सौम्यं जनार्दन ।<br/> &nbsp&nbsp&nbsp&nbsp  इदानीमस्मि संवृत्तः सचेताः प्रकृतिं गतः ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  अर्जुन बोले- हे जनार्दन! आपके इस अतिशांत मनुष्य रूप को देखकर अब मैं स्थिरचित्त हो गया हूँ और अपनी स्वाभाविक स्थिति को प्राप्त हो गया हूँ",
    // ];

    // let chapter12 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp तेषामहं समुद्धर्ता मृत्युसंसारसागरात् ।<br/> &nbsp&nbsp&nbsp&nbsp भवामि नचिरात्पार्थ मय्यावेशितचेतसाम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे अर्जुन! उन मुझमें चित्त लगाने वाले प्रेमी भक्तों का मैं शीघ्र ही मृत्यु रूप संसार-समुद्र से उद्धार करने वाला होता हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp मय्येव मन आधत्स्व मयि बुद्धिं निवेशय ।<br/> &nbsp&nbsp&nbsp&nbsp निवसिष्यसि मय्येव अत ऊर्ध्वं न संशयः ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp मुझमें मन को लगा और मुझमें ही बुद्धि को लगा, इसके उपरान्त तू मुझमें ही निवास करेगा, इसमें कुछ भी संशय नहीं है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अनपेक्षः शुचिर्दक्ष उदासीनो गतव्यथः ।<br/> &nbsp&nbsp&nbsp&nbsp सर्वारम्भपरित्यागी यो मद्भक्तः स मे प्रियः ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp जो पुरुष आकांक्षा से रहित, बाहर-भीतर से शुद्ध, चतुर, पक्षपात से रहित और दुःखों से छूटा हुआ है- वह सब आरम्भों का त्यागी मेरा भक्त मुझको प्रिय है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp समः शत्रौ च मित्रे च तथा मानापमानयोः ।<br/> &nbsp&nbsp&nbsp&nbsp शीतोष्णसुखदुःखेषु समः सङ्गविवर्जितः ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp जो शत्रु-मित्र में और मान-अपमान में सम है तथा सर्दी, गर्मी और सुख-दुःखादि द्वंद्वों में सम है और आसक्ति से रहित है",
    // ];

    // let chapter13 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp इति क्षेत्रं तथा ज्ञानं ज्ञेयं चोक्तं समासतः ।<br/> &nbsp&nbsp&nbsp&nbsp  मद्भक्त एतद्विज्ञाय मद्भावायोपपद्यते ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp इस प्रकार क्षेत्र तथा ज्ञान और जानने योग्य परमात्मा का स्वरूप संक्षेप में कहा गया। मेरा भक्त इसको तत्व से जानकर मेरे स्वरूप को प्राप्त होता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp प्रकृतिं पुरुषं चैव विद्ध्यनादी उभावपि ।<br/> &nbsp&nbsp&nbsp&nbsp  विकारांश्च गुणांश्चैव विद्धि प्रकृतिसंभवान् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp प्रकृति और पुरुष- इन दोनों को ही तू अनादि जान और राग-द्वेषादि विकारों को तथा त्रिगुणात्मक सम्पूर्ण पदार्थों को भी प्रकृति से ही उत्पन्न जान",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp समं सर्वेषु भूतेषु तिष्ठन्तं परमेश्वरम् ।<br/> &nbsp&nbsp&nbsp&nbsp  विनश्यत्स्वविनश्यन्तं यः पश्यति स पश्यति ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp जो पुरुष नष्ट होते हुए सब चराचर भूतों में परमेश्वर को नाशरहित और समभाव से स्थित देखता है वही यथार्थ देखता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यथा प्रकाशयत्येकः कृत्स्नं लोकमिमं रविः ।<br/> &nbsp&nbsp&nbsp&nbsp  क्षेत्रं क्षेत्री तथा कृत्स्नं प्रकाशयति भारत ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे अर्जुन! जिस प्रकार एक ही सूर्य इस सम्पूर्ण ब्रह्माण्ड को प्रकाशित करता है, उसी प्रकार एक ही आत्मा सम्पूर्ण क्षेत्र को प्रकाशित करता है",
    // ];

    // let chapter14 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp ब्रह्मणो हि प्रतिष्ठाहम मृतस्याव्ययस्य च ।<br/> &nbsp&nbsp&nbsp&nbsp  शाश्वतस्य च धर्मस्य सुखस्यैकान्तिकस्य च ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  क्योंकि उस अविनाशी परब्रह्म का और अमृत का तथा नित्य धर्म का और अखण्ड एकरस आनन्द का आश्रय मैं हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp मानापमानयोस् तुल्यस्तुल्यो मित्रारिपक्षयोः ।<br/> &nbsp&nbsp&nbsp&nbsp  सर्वारम्भपरित्यागी गुणातीतः स उच्यते ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  जो मान और अपमान में सम है, मित्र और वैरी के पक्ष में भी सम है एवं सम्पूर्ण आरम्भों में कर्तापन के अभिमान से रहित है, वह पुरुष गुणातीत कहा जाता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp सत्त्वात्संजायते ज्ञानं रजसो लोभ एव च ।<br/> &nbsp&nbsp&nbsp&nbsp  प्रमादमोहौ तमसो भवतोऽज्ञानमेव च ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  सत्त्वगुण से ज्ञान उत्पन्न होता है और रजोगुण से निःसन्देह लोभ तथा तमोगुण से प्रमाद और मोह उत्पन्न होते हैं और अज्ञान भी होता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp कर्मणः सुकृतस्याहुः सात्त्विकं निर्मलं फलम् ।<br/> &nbsp&nbsp&nbsp&nbsp  रजसस्तु फलं दुःखम ज्ञानं तमसः फलम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  श्रेष्ठ कर्म का तो सात्त्विक अर्थात् सुख, ज्ञान और वैराग्यादि निर्मल फल कहा है, राजस कर्म का फल दुःख एवं तामस कर्म का फल अज्ञान कहा है",
    // ];

    // let chapter15 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यदादित्यगतं तेजो जगद्भासयतेऽखिलम् ।<br/> &nbsp&nbsp&nbsp&nbsp यच्चन्द्रमसि यच्चाग्नौ तत्तेजो विद्धि मामकम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp सूर्य में स्थित जो तेज सम्पूर्ण जगत को प्रकाशित करता है तथा जो तेज चन्द्रमा में है और जो अग्नि में है- उसको तू मेरा ही तेज जान",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp द्वाविमौ पुरुषौ लोके क्षरश्चाक्षर एव च ।<br/> &nbsp&nbsp&nbsp&nbsp क्षरः सर्वाणि भूतानि कूटस्थोऽक्षर उच्यते ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp इस संसार में नाशवान और अविनाशी भी ये दो प्रकार के पुरुष हैं। इनमें सम्पूर्ण भूतप्राणियों के शरीर तो नाशवान और जीवात्मा अविनाशी कहा जाता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यो मामेवमसंमूढो जानाति पुरुषोत्तमम् ।<br/> &nbsp&nbsp&nbsp&nbsp स सर्वविद्भजति मां सर्वभावेन भारत ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp भारत! जो ज्ञानी पुरुष मुझको इस प्रकार तत्त्व से पुरुषोत्तम जानता है, वह सर्वज्ञ पुरुष सब प्रकार से निरन्तर मुझ वासुदेव परमेश्वर को ही भजता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp इति गुह्यतमं शास्त्र मिदमुक्तं मयानघ ।<br/> &nbsp&nbsp&nbsp&nbsp एतद्‌बुद्ध्वा बुद्धिमान् स्यात्कृतकृत्यश्च भारत ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp हे निष्पाप अर्जुन! इस प्रकार यह अति रहस्ययुक्त गोपनीय शास्त्र मेरे द्वारा कहा गया, इसको तत्त्व से जानकर मनुष्य ज्ञानवान और कृतार्थ हो जाता है",
    // ];

    // let chapter16 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp तानहं द्विषतः क्रुरान् संसारेषु नराधमान् ।<br/> &nbsp&nbsp&nbsp&nbsp  क्षिपाम्यजस्रमशुभाना सुरीष्वेव योनिषु ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp उन द्वेष करने वाले पापाचारी और क्रूरकर्मी नराधमों को मैं संसार में बार-बार आसुरी योनियों में ही डालता हूँ",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यः शास्त्रविधिमुत्सृज्य वर्तते कामकारतः ।<br/> &nbsp&nbsp&nbsp&nbsp  न स सिद्धिमवाप्नोति न सुखं न परां गतिम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp जो पुरुष शास्त्र विधि को त्यागकर अपनी इच्छा से मनमाना आचरण करता है, वह न सिद्धि को प्राप्त होता है, न परमगति को और न सुख को ही",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp तस्माच्छास्त्रं प्रमाणं ते कार्याकार्यव्यवस्थितौ ।<br/> &nbsp&nbsp&nbsp&nbsp  ज्ञात्वा शास्त्रविधानोक्तं कर्म कर्तुमिहार्हसि ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp इससे तेरे लिए इस कर्तव्य और अकर्तव्य की व्यवस्था में शास्त्र ही प्रमाण है। ऐसा जानकर तू शास्त्र विधि से नियत कर्म ही करने योग्य है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp आत्मसंभाविताः स्तब्धा धनमानमदान्विताः ।<br/> &nbsp&nbsp&nbsp&nbsp  यजन्ते नामयज्ञैस्ते दम्भेनाविधिपूर्वकम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp वे अपने-आपको ही श्रेष्ठ मानने वाले घमण्डी पुरुष धन और मान के मद से युक्त होकर केवल नाममात्र के यज्ञों द्वारा पाखण्ड से शास्त्रविधिरहित यजन करते हैं",
    // ];

    // let chapter17 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp श्रद्धया परया तप्तं तपस् तत्त्रिविधं नरैः ।<br/> &nbsp&nbsp&nbsp&nbsp  अफलाकाङ्क्षिभिर्युक्तैः सात्त्विकं परिचक्षते ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  फल को न चाहने वाले योगी पुरुषों द्वारा परम श्रद्धा से किए हुए उस पूर्वोक्त तीन प्रकार के तप को सात्त्विक कहते हैं",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp मूढग्राहेणात्मनो यत्पीडया क्रियते तपः ।<br/> &nbsp&nbsp&nbsp&nbsp  परस्योत्सादनार्थं वा तत्तामसमुदाहृतम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  जो तप मूढ़तापूर्वक हठ से, मन, वाणी और शरीर की पीड़ा के सहित अथवा दूसरे का अनिष्ट करने के लिए किया जाता है- वह तप तामस कहा गया है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अदेशकाले यद्दानम पात्रेभ्यश्च दीयते ।<br/> &nbsp&nbsp&nbsp&nbsp  असत्कृतमवज्ञातं तत्तामसमुदाहृतम् ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  जो दान बिना सत्कार के अथवा तिरस्कारपूर्वक अयोग्य देश-काल में और कुपात्र के प्रति दिया जाता है, वह दान तामस कहा गया है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp ॐतत्सदिति निर्देशो ब्रह्मणस्त्रिविधः स्मृतः ।<br/> &nbsp&nbsp&nbsp&nbsp  ब्राह्मणास्तेन वेदाश्च यज्ञाश्च विहिताः पुरा ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  ॐ, तत्‌, सत्‌-ऐसे यह तीन प्रकार का सच्चिदानन्दघन ब्रह्म का नाम कहा है, उसी से सृष्टि के आदिकाल में ब्राह्मण और वेद तथा यज्ञादि रचे गए",
    // ];

    // let chapter18 = [
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp अनुबन्धं क्षयं हिंसा मनवेक्ष्य च पौरुषम् ।<br/> &nbsp&nbsp&nbsp&nbsp  मोहादारभ्यते कर्म यत्तत्तामसमुच्यते ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  जो कर्म परिणाम, हानि, हिंसा और सामर्थ्य को न विचारकर केवल अज्ञान से आरंभ किया जाता है, वह तामस कहा जाता है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp बुद्धेर्भेदं धृतेश्चैव गुणतस्त्रिविधं शृणु ।<br/> &nbsp&nbsp&nbsp&nbsp  प्रोच्यमानमशेषेण पृथक्त्वेन धनंजय ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  हे धनंजय ! अब तू बुद्धि का और धृति का भी गुणों के अनुसार तीन प्रकार का भेद मेरे द्वारा सम्पूर्णता से विभागपूर्वक कहा जाने वाला सुन",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp यया धर्ममधर्मं च कार्यं चाकार्यमेव च ।<br/> &nbsp&nbsp&nbsp&nbsp  अयथावत्प्रजानाति बुद्धिः सा पार्थ राजसी ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  हे पार्थ! मनुष्य जिस बुद्धि के द्वारा धर्म और अधर्म को तथा कर्तव्य और अकर्तव्य को भी यथार्थ नहीं जानता, वह बुद्धि राजसी है",
    //   "श्लोक: <br/> &nbsp&nbsp&nbsp नियतं सङ्गरहितम रागद्वेषतः कृतम् ।<br/> &nbsp&nbsp&nbsp&nbsp  अफलप्रेप्सुना कर्म यत्तत्सात्त्विकमुच्यते ॥<br/> अर्थात: <br/>&nbsp&nbsp&nbsp&nbsp  जो कर्म शास्त्रविधि से नियत किया हुआ और कर्तापन के अभिमान से रहित हो तथा फल न चाहने वाले पुरुष द्वारा बिना राग-द्वेष के किया गया हो- वह सात्त्विक कहा जाता है",
    // ];

    // let shlokas = [
    //   chapter1,
    //   chapter2,
    //   chapter3,
    //   chapter4,
    //   chapter5,
    //   chapter6,
    //   chapter7,
    //   chapter8,
    //   chapter9,
    //   chapter10,
    //   chapter11,
    //   chapter12,
    //   chapter13,
    //   chapter14,
    //   chapter15,
    //   chapter16,
    //   chapter17,
    //   chapter18,
    // ];

    // var getMeRandomElements = function (sourceArray) {
    //   var result = [];
    //   while (result.length < 2) {
    //     var item = sourceArray[Math.floor(Math.random() * sourceArray.length)];
    //     // console.log(Math.floor(Math.random() * sourceArray.length));
    //     if (result.indexOf(item) === -1) {
    //       // console.log(item);
    //       result.push(
    //         sourceArray[Math.floor(Math.random() * sourceArray.length)]
    //       );
    //     }
    //   }

    //   return result;
    // };

    var getMeRandomIndex = function (min, max) {
      var item = Math.floor(Math.random() * (max - min + 1) + min);
      return item;
    };

    var randomIndexArray = [];

    while (randomIndexArray.length < 2) {
      let index = getMeRandomIndex(0, 3);
      // console.log(index);
      if (randomIndexArray.indexOf(index) === -1) {
        randomIndexArray.push(index);
      }
    }

    // for (i in randomIndexArray) {
    //   console.log(i);
    // }
    const shlok = [
      shlokas[ind][randomIndexArray[0]],
      shlokas[ind][randomIndexArray[1]],
    ];

    res.json({
      shlok,
    });
  } catch (error) {
    res.json(error.message);
  }
};

module.exports = shlokaCtrl;
